---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartAngleOption
source: html/da5007e7-00b5-4dad-4dea-289f42ab78ff.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartAngleOption Property

"Angle Option"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartAngleOption { get; }
```